zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_regdef.h
/** \brief Time-Stamp Register ${x} */
typedef struct _Ifx_EDSADC_CH_TSTMP_Bits
{
    Ifx_UReg_32Bit TIMESTAMP:16;      /**< \brief [15:0] The Most Recent Captured Timestamp Value - TIMESTAMP (rh) */
    Ifx_UReg_32Bit AMX:2;             /**< \brief [17:16] Analog Multiplexer Setting - AMX (rh) */
    Ifx_UReg_32Bit reserved_18:13;    /**< \brief [30:18] \internal Reserved */
    Ifx_UReg_32Bit TSVAL:1;           /**< \brief [31:31] Timestamp Valid - TSVAL (rh) */
} Ifx_EDSADC_CH_TSTMP_Bits;

/** \brief Common Mode Voltage Register ${x} */
typedef struct _Ifx_EDSADC_CH_VCM_Bits
{
    Ifx_UReg_32Bit VREFXSEL:2;        /**< \brief [1:0] Fractional Reference Voltage Selection - VREFXSEL (rw) */
    Ifx_UReg_32Bit VXON:1;            /**< \brief [2:2] Fractional Reference Voltage Enable - VXON (rw) */
    Ifx_UReg_32Bit reserved_3:13;     /**< \brief [15:3] \internal Reserved */
    Ifx_UReg_32Bit INPVC0:1;          /**< \brief [16:16] Voltage Control of Positive Inputs 0 of CH0 (rw) */
    Ifx_UReg_32Bit INPVC1:1;          /**< \brief [17:17] Voltage Control of Positive Inputs 1 of CH0 (rw) */
    Ifx_UReg_32Bit INPVC2:1;          /**< \brief [18:18] Voltage Control of Positive Inputs 2 of CH0 (rw) */
    Ifx_UReg_32Bit INPVC3:1;          /**< \brief [19:19] Voltage Control of Positive Inputs 3 of CH0 (rw) */
    Ifx_UReg_32Bit INNVC0:1;          /**< \brief [20:20] Voltage Control of Negative Inputs 0 of CH0 (rw) */
    Ifx_UReg_32Bit INNVC1:1;          /**< \brief [21:21] Voltage Control of Negative Inputs 1 of CH0 (rw) */
    Ifx_UReg_32Bit INNVC2:1;          /**< \brief [22:22] Voltage Control of Negative Inputs 2 of CH0 (rw) */
    Ifx_UReg_32Bit INNVC3:1;          /**< \brief [23:23] Voltage Control of Negative Inputs 3 of CH0 (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_EDSADC_CH_VCM_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_EDSADC_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Module Disable Request Bit - DISR (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Module Disable Status Bit - DISS (r) */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit EDIS:1;            /**< \brief [3:3] Sleep Mode Enable Control - EDIS (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_EDSADC_CLC_Bits;

/** \brief Event Flag Register */
typedef struct _Ifx_EDSADC_EVFLAG_Bits
{
    Ifx_UReg_32Bit RESEV0:1;          /**< \brief [0:0] Result Event - RESEV0 (rwh) */
    Ifx_UReg_32Bit RESEV1:1;          /**< \brief [1:1] Result Event - RESEV1 (rwh) */
    Ifx_UReg_32Bit RESEV2:1;          /**< \brief [2:2] Result Event - RESEV2 (rwh) */
    Ifx_UReg_32Bit RESEV3:1;          /**< \brief [3:3] Result Event - RESEV3 (rwh) */
    Ifx_UReg_32Bit RESEV4:1;          /**< \brief [4:4] Result Event - RESEV4 (rwh) */
    Ifx_UReg_32Bit RESEV5:1;          /**< \brief [5:5] Result Event - RESEV5 (rwh) */
    Ifx_UReg_32Bit RESEV6:1;          /**< \brief [6:6] Result Event - RESEV6 (rwh) */
    Ifx_UReg_32Bit RESEV7:1;          /**< \brief [7:7] Result Event - RESEV7 (rwh) */
    Ifx_UReg_32Bit RESEV8:1;          /**< \brief [8:8] Result Event - RESEV8 (rwh) */
    Ifx_UReg_32Bit RESEV9:1;          /**< \brief [9:9] Result Event - RESEV9 (rwh) */
    Ifx_UReg_32Bit RESEV10:1;         /**< \brief [10:10] Result Event - RESEV10 (rwh) */
    Ifx_UReg_32Bit RESEV11:1;         /**< \brief [11:11] Result Event - RESEV11 (rwh) */
    Ifx_UReg_32Bit RESEV12:1;         /**< \brief [12:12] Result Event - RESEV12 (rwh) */
    Ifx_UReg_32Bit RESEV13:1;         /**< \brief [13:13] Result Event - RESEV13 (rwh) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit ALEV0:1;           /**< \brief [16:16] Alarm Event - ALEV0 (rwh) */
    Ifx_UReg_32Bit ALEV1:1;           /**< \brief [17:17] Alarm Event - ALEV1 (rwh) */
    Ifx_UReg_32Bit ALEV2:1;           /**< \brief [18:18] Alarm Event - ALEV2 (rwh) */
    Ifx_UReg_32Bit ALEV3:1;           /**< \brief [19:19] Alarm Event - ALEV3 (rwh) */
    Ifx_UReg_32Bit ALEV4:1;           /**< \brief [20:20] Alarm Event - ALEV4 (rwh) */
    Ifx_UReg_32Bit ALEV5:1;           /**< \brief [21:21] Alarm Event - ALEV5 (rwh) */
    Ifx_UReg_32Bit ALEV6:1;           /**< \brief [22:22] Alarm Event - ALEV6 (rwh) */
    Ifx_UReg_32Bit ALEV7:1;           /**< \brief [23:23] Alarm Event - ALEV7 (rwh) */
    Ifx_UReg_32Bit ALEV8:1;           /**< \brief [24:24] Alarm Event - ALEV8 (rwh) */
    Ifx_UReg_32Bit ALEV9:1;           /**< \brief [25:25] Alarm Event - ALEV9 (rwh) */
    Ifx_UReg_32Bit ALEV10:1;          /**< \brief [26:26] Alarm Event - ALEV10 (rwh) */
    Ifx_UReg_32Bit ALEV11:1;          /**< \brief [27:27] Alarm Event - ALEV11 (rwh) */
    Ifx_UReg_32Bit ALEV12:1;          /**< \brief [28:28] Alarm Event - ALEV12 (rwh) */
    Ifx_UReg_32Bit ALEV13:1;          /**< \brief [29:29] Alarm Event - ALEV13 (rwh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_EVFLAG_Bits;

/** \brief Event Flag Clear Register */
typedef struct _Ifx_EDSADC_EVFLAGCLR_Bits
{
    Ifx_UReg_32Bit RESEC0:1;          /**< \brief [0:0] Result Event Clear - RESEC0 (w) */
    Ifx_UReg_32Bit RESEC1:1;          /**< \brief [1:1] Result Event Clear - RESEC1 (w) */
    Ifx_UReg_32Bit RESEC2:1;          /**< \brief [2:2] Result Event Clear - RESEC2 (w) */
    Ifx_UReg_32Bit RESEC3:1;          /**< \brief [3:3] Result Event Clear - RESEC3 (w) */
    Ifx_UReg_32Bit RESEC4:1;          /**< \brief [4:4] Result Event Clear - RESEC4 (w) */
    Ifx_UReg_32Bit RESEC5:1;          /**< \brief [5:5] Result Event Clear - RESEC5 (w) */
    Ifx_UReg_32Bit RESEC6:1;          /**< \brief [6:6] Result Event Clear - RESEC6 (w) */
    Ifx_UReg_32Bit RESEC7:1;          /**< \brief [7:7] Result Event Clear - RESEC7 (w) */
    Ifx_UReg_32Bit RESEC8:1;          /**< \brief [8:8] Result Event Clear - RESEC8 (w) */
    Ifx_UReg_32Bit RESEC9:1;          /**< \brief [9:9] Result Event Clear - RESEC9 (w) */
    Ifx_UReg_32Bit RESEC10:1;         /**< \brief [10:10] Result Event Clear - RESEC10 (w) */
    Ifx_UReg_32Bit RESEC11:1;         /**< \brief [11:11] Result Event Clear - RESEC11 (w) */
    Ifx_UReg_32Bit RESEC12:1;         /**< \brief [12:12] Result Event Clear - RESEC12 (w) */
    Ifx_UReg_32Bit RESEC13:1;         /**< \brief [13:13] Result Event Clear - RESEC13 (w) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit ALEC0:1;           /**< \brief [16:16] Alarm Event Clear - ALEC0 (w) */
    Ifx_UReg_32Bit ALEC1:1;           /**< \brief [17:17] Alarm Event Clear - ALEC1 (w) */
    Ifx_UReg_32Bit ALEC2:1;           /**< \brief [18:18] Alarm Event Clear - ALEC2 (w) */
    Ifx_UReg_32Bit ALEC3:1;           /**< \brief [19:19] Alarm Event Clear - ALEC3 (w) */
    Ifx_UReg_32Bit ALEC4:1;           /**< \brief [20:20] Alarm Event Clear - ALEC4 (w) */
    Ifx_UReg_32Bit ALEC5:1;           /**< \brief [21:21] Alarm Event Clear - ALEC5 (w) */
    Ifx_UReg_32Bit ALEC6:1;           /**< \brief [22:22] Alarm Event Clear - ALEC6 (w) */
    Ifx_UReg_32Bit ALEC7:1;           /**< \brief [23:23] Alarm Event Clear - ALEC7 (w) */
    Ifx_UReg_32Bit ALEC8:1;           /**< \brief [24:24] Alarm Event Clear - ALEC8 (w) */
    Ifx_UReg_32Bit ALEC9:1;           /**< \brief [25:25] Alarm Event Clear - ALEC9 (w) */
    Ifx_UReg_32Bit ALEC10:1;          /**< \brief [26:26] Alarm Event Clear - ALEC10 (w) */
    Ifx_UReg_32Bit ALEC11:1;          /**< \brief [27:27] Alarm Event Clear - ALEC11 (w) */
    Ifx_UReg_32Bit ALEC12:1;          /**< \brief [28:28] Alarm Event Clear - ALEC12 (w) */
    Ifx_UReg_32Bit ALEC13:1;          /**< \brief [29:29] Alarm Event Clear - ALEC13 (w) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_EVFLAGCLR_Bits;

/** \brief Global Configuration Register */
typedef struct _Ifx_EDSADC_GLOBCFG_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit DITRIM:3;          /**< \brief [10:8] Trimming Value for the Dithering Function - DITRIM (rw) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit USC:1;             /**< \brief [12:12] Unsynchronized Clock Generation - USC (rw) */
    Ifx_UReg_32Bit SUPLEV:2;          /**< \brief [14:13] Supply Voltage Level (rw) */
    Ifx_UReg_32Bit CPWC:1;            /**< \brief [15:15] Write Control for Clock Parameters - CPWC (w) */
    Ifx_UReg_32Bit reserved_16:8;     /**< \brief [23:16] \internal Reserved */
    Ifx_UReg_32Bit SVCH:4;            /**< \brief [27:24] Supervision Channel Select (rw) */
    Ifx_UReg_32Bit SVSIG:2;           /**< \brief [29:28] Supervision Signal Select (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit SVWC:1;            /**< \brief [31:31] Write Control for Supervision Parameters (w) */
} Ifx_EDSADC_GLOBCFG_Bits;

/** \brief Global Run Control Register */
typedef struct _Ifx_EDSADC_GLOBRC_Bits
{
    Ifx_UReg_32Bit CH0RUN:1;          /**< \brief [0:0] Channel 0 Run Control - CH0RUN (rw) */
    Ifx_UReg_32Bit CH1RUN:1;          /**< \brief [1:1] Channel 1 Run Control - CH1RUN (rw) */
    Ifx_UReg_32Bit CH2RUN:1;          /**< \brief [2:2] Channel 2 Run Control - CH2RUN (rw) */
    Ifx_UReg_32Bit CH3RUN:1;          /**< \brief [3:3] Channel 3 Run Control - CH3RUN (rw) */
    Ifx_UReg_32Bit CH4RUN:1;          /**< \brief [4:4] Channel 4 Run Control - CH4RUN (rw) */
    Ifx_UReg_32Bit CH5RUN:1;          /**< \brief [5:5] Channel 5 Run Control - CH5RUN (rw) */
    Ifx_UReg_32Bit CH6RUN:1;          /**< \brief [6:6] Channel 6 Run Control - CH6RUN (rw) */
    Ifx_UReg_32Bit CH7RUN:1;          /**< \brief [7:7] Channel 7 Run Control - CH7RUN (rw) */
    Ifx_UReg_32Bit CH8RUN:1;          /**< \brief [8:8] Channel 8 Run Control - CH8RUN (rw) */
    Ifx_UReg_32Bit CH9RUN:1;          /**< \brief [9:9] Channel 9 Run Control - CH9RUN (rw) */
    Ifx_UReg_32Bit CH10RUN:1;         /**< \brief [10:10] Channel 10 Run Control - CH10RUN (rw) */
    Ifx_UReg_32Bit CH11RUN:1;         /**< \brief [11:11] Channel 11 Run Control - CH11RUN (rw) */
    Ifx_UReg_32Bit CH12RUN:1;         /**< \brief [12:12] Channel 12 Run Control - CH12RUN (rw) */
    Ifx_UReg_32Bit CH13RUN:1;         /**< \brief [13:13] Channel 13 Run Control - CH13RUN (rw) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit M0RUN:1;           /**< \brief [16:16] Modulator 0 Run Control - M0RUN (rw) */
    Ifx_UReg_32Bit M1RUN:1;           /**< \brief [17:17] Modulator 1 Run Control - M1RUN (rw) */
    Ifx_UReg_32Bit M2RUN:1;           /**< \brief [18:18] Modulator 2 Run Control - M2RUN (rw) */
    Ifx_UReg_32Bit M3RUN:1;           /**< \brief [19:19] Modulator 3 Run Control - M3RUN (rw) */
    Ifx_UReg_32Bit M4RUN:1;           /**< \brief [20:20] Modulator 4 Run Control - M4RUN (rw) */
    Ifx_UReg_32Bit M5RUN:1;           /**< \brief [21:21] Modulator 5 Run Control - M5RUN (rw) */
    Ifx_UReg_32Bit M6RUN:1;           /**< \brief [22:22] Modulator 6 Run Control - M6RUN (rw) */
    Ifx_UReg_32Bit M7RUN:1;           /**< \brief [23:23] Modulator 7 Run Control - M7RUN (rw) */
    Ifx_UReg_32Bit M8RUN:1;           /**< \brief [24:24] Modulator 8 Run Control - M8RUN (rw) */
    Ifx_UReg_32Bit M9RUN:1;           /**< \brief [25:25] Modulator 9 Run Control - M9RUN (rw) */
    Ifx_UReg_32Bit M10RUN:1;          /**< \brief [26:26] Modulator 10 Run Control - M10RUN (rw) */
    Ifx_UReg_32Bit M11RUN:1;          /**< \brief [27:27] Modulator 11 Run Control - M11RUN (rw) */
    Ifx_UReg_32Bit M12RUN:1;          /**< \brief [28:28] Modulator 12 Run Control - M12RUN (rw) */
    Ifx_UReg_32Bit M13RUN:1;          /**< \brief [29:29] Modulator 13 Run Control - M13RUN (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_GLOBRC_Bits;

