zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEdsadc_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_EDSADC_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUMBER:16;     /**< \brief [31:16] Module Number - MOD_NUMBER (r) */
} Ifx_EDSADC_ID_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_EDSADC_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_EDSADC_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_EDSADC_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_EDSADC_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_EDSADC_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_EDSADC_KRSTCLR_Bits;

/** \brief OCDS Control and Status Register */
typedef struct _Ifx_EDSADC_OCS_Bits
{
    Ifx_UReg_32Bit reserved_0:24;     /**< \brief [23:0] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_OCS_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_edsadc_Registers_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_ACCEN0_Bits B;         /**< \brief Bitfield access */
} Ifx_EDSADC_ACCEN0;

/** \brief Access Protection Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_ACCPROT_Bits B;        /**< \brief Bitfield access */
} Ifx_EDSADC_ACCPROT;

/** \brief Carrier Generator Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CGCFG_Bits B;          /**< \brief Bitfield access */
} Ifx_EDSADC_CGCFG;

/** \brief Boundary Select Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_BOUNDSEL_Bits B;    /**< \brief Bitfield access */
} Ifx_EDSADC_CH_BOUNDSEL;

/** \brief Carrier Generator Synchronization Reg. ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_CGSYNC_Bits B;      /**< \brief Bitfield access */
} Ifx_EDSADC_CH_CGSYNC;

/** \brief Demodulator Input Config. Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_DICFG_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_DICFG;

/** \brief Auxiliary Filter Configuration Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_FCFGA_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_FCFGA;

/** \brief Filter Configuration Register ${x}, CIC Filter   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_FCFGC_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_FCFGC;

/** \brief Filter Configuration Register ${x}, Main   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_FCFGM_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_FCFGM;

/** \brief Filter Counter Register ${x}, CIC Filter   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_FCNTC_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_FCNTC;

/** \brief Gain Calibration Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_GAINCAL_Bits B;     /**< \brief Bitfield access */
} Ifx_EDSADC_CH_GAINCAL;

/** \brief Gain Correction Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_GAINCORR_Bits B;    /**< \brief Bitfield access */
} Ifx_EDSADC_CH_GAINCORR;

/** \brief Gain Control Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_GAINCTR_Bits B;     /**< \brief Bitfield access */
} Ifx_EDSADC_CH_GAINCTR;

/** \brief Intermediate Integration Value   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_IIVAL_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_IIVAL;

/** \brief Integrator Status Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_ISTAT_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_ISTAT;

/** \brief Integration Window Control Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_IWCTR_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_IWCTR;

